fio_test_results
bgwriter: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
queryA: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
queryB: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=mmap, iodepth=1
bgupdater: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.1
Starting 4 processes
bgwriter: Laying out IO file (1 file / 256MiB)
queryA: Laying out IO file (1 file / 256MiB)
queryB: Laying out IO file (1 file / 256MiB)
bgupdater: Laying out IO file (1 file / 32MiB)
Jobs: 1 (f=1): [_(2),r(1),_(1)][98.6%][r=7556KiB/s,w=0KiB/s][r=1889,w=0 IOPS][eta 00m:01s]      
bgwriter: (groupid=0, jobs=1): err= 0: pid=31467: Thu May  2 01:32:29 2019
  write: IOPS=1958, BW=7833KiB/s (8021kB/s)(256MiB/33468msec)
    slat (usec): min=4, max=3543, avg=10.38, stdev=23.18
    clat (usec): min=363, max=107344, avg=16327.91, stdev=33894.10
     lat (usec): min=375, max=107354, avg=16338.85, stdev=33894.57
    clat percentiles (usec):
     |  1.00th=[   553],  5.00th=[   717], 10.00th=[   832], 20.00th=[   988],
     | 30.00th=[  1123], 40.00th=[  1254], 50.00th=[  1385], 60.00th=[  1532],
     | 70.00th=[  1729], 80.00th=[  2114], 90.00th=[ 92799], 95.00th=[ 93848],
     | 99.00th=[ 94897], 99.50th=[ 95945], 99.90th=[ 99091], 99.95th=[103285],
     | 99.99th=[107480]
   bw (  KiB/s): min= 7496, max= 9304, per=100.00%, avg=7819.85, stdev=195.74, samples=66
   iops        : min= 1874, max= 2326, avg=1954.85, stdev=48.94, samples=66
  lat (usec)   : 500=0.50%, 750=5.58%, 1000=14.63%
  lat (msec)   : 2=57.30%, 4=5.13%, 10=0.33%, 20=0.18%, 50=0.05%
  lat (msec)   : 100=16.21%, 250=0.10%
  cpu          : usr=0.56%, sys=2.74%, ctx=15235, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,65536,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
queryA: (groupid=0, jobs=1): err= 0: pid=31468: Thu May  2 01:32:29 2019
   read: IOPS=968, BW=3876KiB/s (3969kB/s)(256MiB/67639msec)
    clat (usec): min=70, max=66844, avg=1025.00, stdev=5762.01
     lat (usec): min=71, max=66845, avg=1025.59, stdev=5762.01
    clat percentiles (usec):
     |  1.00th=[  200],  5.00th=[  363], 10.00th=[  375], 20.00th=[  388],
     | 30.00th=[  400], 40.00th=[  408], 50.00th=[  416], 60.00th=[  429],
     | 70.00th=[  441], 80.00th=[  457], 90.00th=[  486], 95.00th=[  523],
     | 99.00th=[45351], 99.50th=[57410], 99.90th=[62653], 99.95th=[64750],
     | 99.99th=[65799]
   bw (  KiB/s): min= 2869, max= 4040, per=44.24%, avg=3486.90, stdev=470.25, samples=134
   iops        : min=  717, max= 1010, avg=871.50, stdev=117.65, samples=134
  lat (usec)   : 100=0.02%, 250=1.37%, 500=91.35%, 750=5.21%, 1000=0.32%
  lat (msec)   : 2=0.38%, 4=0.21%, 10=0.08%, 20=0.04%, 50=0.06%
  lat (msec)   : 100=0.97%
  cpu          : usr=0.60%, sys=1.57%, ctx=130303, majf=65536, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
queryB: (groupid=0, jobs=1): err= 0: pid=31469: Thu May  2 01:32:29 2019
   read: IOPS=955, BW=3823KiB/s (3914kB/s)(256MiB/68578msec)
    clat (usec): min=284, max=66750, avg=1037.33, stdev=5772.53
     lat (usec): min=284, max=66751, avg=1037.92, stdev=5772.52
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  375], 10.00th=[  383], 20.00th=[  396],
     | 30.00th=[  404], 40.00th=[  412], 50.00th=[  420], 60.00th=[  433],
     | 70.00th=[  445], 80.00th=[  461], 90.00th=[  490], 95.00th=[  529],
     | 99.00th=[45876], 99.50th=[57934], 99.90th=[62653], 99.95th=[64750],
     | 99.99th=[65799]
   bw (  KiB/s): min= 2734, max= 5768, per=43.27%, avg=3410.43, stdev=528.54, samples=136
   iops        : min=  683, max= 1442, avg=852.46, stdev=132.29, samples=136
  lat (usec)   : 500=91.93%, 750=5.99%, 1000=0.30%
  lat (msec)   : 2=0.40%, 4=0.21%, 10=0.09%, 20=0.05%, 50=0.06%
  lat (msec)   : 100=0.97%
  cpu          : usr=0.61%, sys=1.81%, ctx=129826, majf=65536, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=65536,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
bgupdater: (groupid=0, jobs=1): err= 0: pid=31470: Thu May  2 01:32:29 2019
   read: IOPS=95, BW=382KiB/s (392kB/s)(15.9MiB/42532msec)
    slat (usec): min=5, max=2257, avg=11.53, stdev=38.71
    clat (usec): min=86, max=66552, avg=4965.96, stdev=13663.72
     lat (usec): min=97, max=66570, avg=4978.07, stdev=13666.03
    clat percentiles (usec):
     |  1.00th=[  115],  5.00th=[  371], 10.00th=[  383], 20.00th=[  396],
     | 30.00th=[  408], 40.00th=[  416], 50.00th=[  429], 60.00th=[  441],
     | 70.00th=[  461], 80.00th=[  502], 90.00th=[35390], 95.00th=[40109],
     | 99.00th=[63701], 99.50th=[64750], 99.90th=[65799], 99.95th=[65799],
     | 99.99th=[66323]
   bw (  KiB/s): min=   40, max= 1611, per=4.83%, avg=380.36, stdev=583.92, samples=85
   iops        : min=   10, max=  402, avg=95.04, stdev=145.87, samples=85
  write: IOPS=96, BW=388KiB/s (397kB/s)(16.1MiB/42532msec)
    slat (usec): min=5, max=2649, avg=12.47, stdev=41.16
    clat (usec): min=312, max=94199, avg=5312.52, stdev=16155.16
     lat (usec): min=323, max=94212, avg=5325.59, stdev=16156.00
    clat percentiles (usec):
     |  1.00th=[  347],  5.00th=[  363], 10.00th=[  375], 20.00th=[  388],
     | 30.00th=[  400], 40.00th=[  412], 50.00th=[  429], 60.00th=[  445],
     | 70.00th=[  474], 80.00th=[  553], 90.00th=[ 1303], 95.00th=[59507],
     | 99.00th=[60031], 99.50th=[60556], 99.90th=[68682], 99.95th=[71828],
     | 99.99th=[93848]
   bw (  KiB/s): min=   40, max= 1707, per=5.87%, avg=384.81, stdev=585.42, samples=85
   iops        : min=   10, max=  426, avg=96.14, stdev=146.23, samples=85
  lat (usec)   : 100=0.24%, 250=1.21%, 500=76.07%, 750=8.74%, 1000=2.15%
  lat (msec)   : 2=1.86%, 4=0.17%, 10=0.27%, 20=0.04%, 50=4.10%
  lat (msec)   : 100=5.15%
  cpu          : usr=0.36%, sys=0.93%, ctx=8188, majf=0, minf=27
  IO depths    : 1=99.8%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=4067,4125,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=7882KiB/s (8072kB/s), 382KiB/s-3876KiB/s (392kB/s-3969kB/s), io=528MiB (554MB), run=42532-68578msec
  WRITE: bw=6551KiB/s (6709kB/s), 388KiB/s-7833KiB/s (397kB/s-8021kB/s), io=272MiB (285MB), run=33468-42532msec

Disk stats (read/write):
  vda: ios=134830/69767, merge=0/1209, ticks=153056/1088463, in_queue=1196559, util=94.09%